{"backend": "theano", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"stateful": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "return_sequences": false, "batch_input_shape": [1, 5, 1], "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "dtype": "float32", "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 4, "bias_regularizer": null, "implementation": 0, "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 1, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}}]}